app/views/riesitel_seria/index.html.erb

              <tr>
                <td><% r = Riesitel.find(riesitel_serium.riesitel_id) %><%= r.meno + ' ' + r.priezvisko %><%= hidden_field_tag "ids[]", riesitel_serium.id %></td>
---
SELECT  `riesitels`.* FROM `riesitels` WHERE `riesitels`.`id` = 1 LIMIT 1