app/views/knizkas/show.html.erb

    <i class="right chevron icon divider"></i>
    <%= link_to "#{@knizka.rocnik}. ročník", rocnik_path(Rocnik.find_by_cislo(@knizka.rocnik)), class: 'section' %>
---
SELECT  `rocniks`.* FROM `rocniks` WHERE `rocniks`.`cislo` = 19 LIMIT 1

      <% if @knizka.knizka_obsahs.any? %>
          <% @knizka.knizka_obsahs.order(:cislo).each do |k| %>
---
SELECT `knizka_obsahs`.* FROM `knizka_obsahs` WHERE `knizka_obsahs`.`knizka_id` = 3  ORDER BY `knizka_obsahs`.`cislo` ASC

        <tbody>
        <% if @knizka.pdfs.any? %>
---
SELECT COUNT(*) FROM `pdfs` WHERE `pdfs`.`knizka_id` = 3
SELECT `pdfs`.* FROM `pdfs` WHERE `pdfs`.`knizka_id` = 3  ORDER BY created_at DESC