app/views/homepages/index.html.erb

          <div class="description m-t-1">
            <% if @aktualna_knizka.knizka_obsahs.count > 0 %>
                <div class="ui list">
                  <% @aktualna_knizka.knizka_obsahs.order(:cislo).each do |k| %>
---
SELECT COUNT(*) FROM `knizka_obsahs` WHERE `knizka_obsahs`.`knizka_id` = 5
SELECT `knizka_obsahs`.* FROM `knizka_obsahs` WHERE `knizka_obsahs`.`knizka_id` = 5  ORDER BY `knizka_obsahs`.`cislo` ASC

          <%= link_to "Prihlás sa", opravas_path(rocnik: @aktualny_rocnik.cislo, seria: 'Letná', kolo: 1), class: 'ui green button' %>
          <% o = Oprava.where(rocnik: @aktualny_rocnik.cislo, seria: 'Letná', kolo: 1).take %>
          <% if o && !o.priklady.blank? && !eval(o.priklady).blank? %>
---
SELECT  `opravas`.* FROM `opravas` WHERE `opravas`.`rocnik` = 19 AND `opravas`.`seria` = 'Letná' AND `opravas`.`kolo` = 1 LIMIT 1
SELECT  `priklads`.* FROM `priklads`  ORDER BY `priklads`.`id` ASC LIMIT 1