app/views/kolos/show.html.erb

SELECT  `rocniks`.* FROM `rocniks` WHERE `rocniks`.`cislo` = 19 LIMIT 1
---
    <i class="right chevron icon divider"></i>
    <%= link_to "#{@kolo.rocnik}. ročník", rocnik_path(Rocnik.find_by_cislo(@kolo.rocnik)), class: 'section' %>

SELECT  `priklads`.* FROM `priklads` WHERE `priklads`.`kolo_id` = 1 AND `priklads`.`cislo_v_kole` = 1 LIMIT 1
---
      <% (1..10).each do |c| %>
          <% p = @kolo.priklads.where(cislo_v_kole: c).take %>