app/views/priklads/index.html.erb

        <td><%= priklad.stav %></td>
        <td><%= priklad.komentars.count %></td>
---
SELECT COUNT(*) FROM `komentars` WHERE `komentars`.`priklad_id` = 1