app/views/priklads/show.html.erb

  <h3 class="ui dividing header">Komentáre</h3>
  <% @priklad.komentars.order('created_at DESC').each do |k| %>
---
SELECT `komentars`.* FROM `komentars` WHERE `komentars`.`priklad_id` = 6  ORDER BY created_at DESC