app/controllers/homepages_controller.rb

  def index
    @homepages = Homepage.all
    @aktualny_rocnik = Rocnik.all.order('cislo DESC').first
    @aktualna_knizka = Knizka.where(rocnik: @aktualny_rocnik.cislo).order('seria ASC').order('cislo DESC').first
    @kola_l = Kolo.where(rocnik: @aktualny_rocnik.cislo, seria: 'Letná').order(:cislo)
---
SELECT `homepages`.* FROM `homepages`
SELECT  `rocniks`.* FROM `rocniks`  ORDER BY cislo DESC LIMIT 1
SELECT `knizkas`.* FROM `knizkas` WHERE `knizkas`.`rocnik` = 19 AND `knizkas`.`seria` = 'Letná'  ORDER BY `knizkas`.`cislo` ASC
SELECT `kolos`.* FROM `kolos` WHERE `kolos`.`rocnik` = 19 AND `kolos`.`seria` = 'Letná'  ORDER BY `kolos`.`cislo` ASC

    def set_homepage
      @homepage = Homepage.find(params[:id])
---
SELECT  `homepages`.* FROM `homepages` WHERE `homepages`.`id` = 0 LIMIT 1