app/controllers/knizkas_controller.rb

SELECT COUNT(*) FROM `knizka_obsahs` WHERE `knizka_obsahs`.`knizka_id` = 3 AND `knizka_obsahs`.`nazov` = 'Zadania 1. kola'
---
  def show
    @pridany_obsah = @knizka.knizka_obsahs
    @obsah = []
    (1..3).each do |i|
      @obsah << { id: "z#{i}", name: "Zadania #{i}. kola", link: nil } if @pridany_obsah.where(nazov: "Zadania #{i}. kola").count == 0

SELECT  `knizkas`.* FROM `knizkas` WHERE `knizkas`.`id` = 3 LIMIT 1
---
  def set_knizka
    @knizka = Knizka.find(params[:id])