app/controllers/kolos_controller.rb

  def show
    @priklads = Priklad.where(kolo_id: nil)
---
SELECT `priklads`.* FROM `priklads` WHERE `priklads`.`kolo_id` IS NULL

  def set_kolo
    @kolo = Kolo.find(params[:id])
---
SELECT  `kolos`.* FROM `kolos` WHERE `kolos`.`id` = 3 LIMIT 1