app/controllers/komentars_controller.rb

SELECT `komentars`.* FROM `komentars`
---
  def index
    @komentars = Komentar.all

INSERT INTO `komentars` (`text`, `priklad_id`, `autor`, `created_at`, `updated_at`) VALUES ('asdsadasd', 1, 'Gege', '2016-11-16 21:12:44.464942', '2016-11-16 21:12:44.464942')
---
  def create
    @komentar = Komentar.new(komentar_params)
    @komentar.autor = "Gege"

    respond_to do |format|
      if @komentar.save

DELETE FROM `komentars` WHERE `komentars`.`id` = 10
---
  def destroy
    @komentar.destroy

SELECT  `komentars`.* FROM `komentars` WHERE `komentars`.`id` = 10 LIMIT 1
---
    def set_komentar
      @komentar = Komentar.find(params[:id])