app/controllers/organizators_controller.rb

SELECT `organizators`.* FROM `organizators`
---
  def index
    @organizators = Organizator.all