app/controllers/priklads_controller.rb

  def index
    @priklads = Priklad.all
---
SELECT `priklads`.* FROM `priklads`

  def create
    @priklad = Priklad.new(priklad_params)

    respond_to do |format|
      if @priklad.save
---
INSERT INTO `priklads` (`nazov`, `text`, `pred_t`, `po_t`, `vzorak`, `autor`, `kategoria`, `stav`, `created_at`, `updated_at`) VALUES ('a', 'as', 'asd', 'asdas', 'dsa', 'das', 'dasd', 'asd', '2016-11-16 19:01:56.871106', '2016-11-16 19:01:56.871106')

  def update
    respond_to do |format|
      if @priklad.update(priklad_params)
---
UPDATE `priklads` SET `kategoria` = 'Séria', `stav` = 'nepozretý', `updated_at` = '2016-11-16 19:57:46.692349' WHERE `priklads`.`id` = 1

  def destroy
    @priklad.destroy
---
DELETE FROM `priklads` WHERE `priklads`.`id` = 1

    def set_priklad
      @priklad = Priklad.find(params[:id])
---
SELECT  `priklads`.* FROM `priklads` WHERE `priklads`.`id` = 1 LIMIT 1