app/controllers/riesitels_controller.rb

  def index
    @riesitels = Riesitel.all
---
SELECT `riesitels`.* FROM `riesitels`

  def create
    @riesitel = Riesitel.new(riesitel_params)

    respond_to do |format|
      if @riesitel.save
---
INSERT INTO `riesitels` (`meno`, `priezvisko`, `adresa`, `datum_narodenia`, `telefon`, `telefon_rodic`, `email`, `created_at`, `updated_at`) VALUES ('Ferko', 'Fero', 'Bratislava', '5.6.2004', '0903564789', '0910231654', 'fero@gmail.com', '2016-11-25 15:36:47.614457', '2016-11-25 15:36:47.614457')

  def destroy
    @riesitel.destroy
---
DELETE FROM `riesitels` WHERE `riesitels`.`id` = 1

  def add_riesitels_to_seria
    if !params[:riesitels].blank?
      seria = Serium.find(params[:seria_id])
      ids = []
      params[:riesitels].each do |rID|
        riesitel = Riesitel.find(rID)
        rSerie = RiesitelSerium.create(riesitel: riesitel, seria: seria.rocnik.to_s + '. ' + seria.nazov, seria_id: seria.id)
---
SELECT  `riesitels`.* FROM `riesitels` WHERE `riesitels`.`id` = 1 LIMIT 1
INSERT INTO `riesitel_seria` (`riesitel_id`, `seria`, `seria_id`, `created_at`, `updated_at`) VALUES (1, '19. Zimná', 3, '2016-11-26 22:01:20.826866', '2016-11-26 22:01:20.826866')

  def add_riesitels
    @riesiteliaToAdd = []
    save = false
    if !params[:meno].blank?
      save = true if params[:commit] == "Pridať"
      params[:meno].each_with_index do |meno, i|
        newRiesitel = Riesitel.new
        newRiesitel.meno = meno
        newRiesitel.priezvisko = params[:priezvisko][i]
        newRiesitel.adresa = params[:adresa][i]
        newRiesitel.datum_narodenia = params[:dat_nar][i]
        newRiesitel.telefon = params[:cislo][i]
        newRiesitel.telefon_rodic = params[:cislo_rodic][i]
        newRiesitel.email = params[:email][i]
        newRiesitel.save if save
---
INSERT INTO `riesitels` (`meno`, `priezvisko`, `adresa`, `datum_narodenia`, `telefon`, `telefon_rodic`, `email`, `created_at`, `updated_at`) VALUES ('', '', '', '', '', '', '', '2016-11-26 21:45:08.436872', '2016-11-26 21:45:08.436872')

  def set_riesitel
    @riesitel = Riesitel.find(params[:id])
---
SELECT  `riesitels`.* FROM `riesitels` WHERE `riesitels`.`id` = 1 LIMIT 1