app/controllers/riesitel_seria_controller.rb

DELETE FROM `riesitel_seria` WHERE `riesitel_seria`.`id` = 2
UPDATE `riesitel_seria` SET `skola` = 'GAMCA', `trieda` = '9.A.', `kategoria` = 9, `eriesitel` = 1, `updated_at` = '2016-11-26 18:35:08.813942' WHERE `riesitel_seria`.`id` = 1
---
  def edit_riesitels
    if !params[:ids].blank?
      riesitel = nil
      sID = nil
      params[:ids].each_with_index do |id, index|
        riesitel = RiesitelSerium.find(id)
        riesitel.skola = params[:skola][index]
        riesitel.trieda = params[:trieda][index]
        riesitel.kategoria = params[:kategoria][index]
        riesitel.eriesitel = false
        sID = riesitel.seria_id
        if !params[:eriesitelia].blank?
          params[:eriesitelia].each do |eId|
            riesitel.eriesitel = true if eId == id
          end
        end
        if !params[:delete].blank?
          params[:delete].each do |dId|
            if dId == id
              riesitel.destroy
              riesitel = nil
            end
          end
        end
        if riesitel != nil
          riesitel.save