app/controllers/rocniks_controller.rb

  def index
    @rocniks = Rocnik.all
---
SELECT  `rocniks`.* FROM `rocniks`  ORDER BY cislo DESC LIMIT 1

  def show
    @kola_z = Kolo.where(rocnik: @rocnik.cislo, seria: 'Zimná').order(:cislo)
    @kola_l = Kolo.where(rocnik: @rocnik.cislo, seria: 'Letná').order(:cislo)
    @seria_z = Serium.where(rocnik: @rocnik.cislo, nazov: 'Zimná').take
    @seria_l = Serium.where(rocnik: @rocnik.cislo, nazov: 'Letná').take
    @knizky_z = Knizka.where(rocnik: @rocnik.cislo, seria: 'Zimná').order(:cislo)
---
SELECT `kolos`.* FROM `kolos` WHERE `kolos`.`rocnik` = 1 AND `kolos`.`seria` = 'Zimná'  ORDER BY `kolos`.`cislo` ASC
SELECT `knizkas`.* FROM `knizkas` WHERE `knizkas`.`rocnik` = 19 AND `knizkas`.`seria` = 'Zimná'  ORDER BY `knizkas`.`cislo` ASC

  def new
    max = Rocnik.order('cislo DESC').first
    redirect_to Rocnik.create(cislo: max.cislo + 1), notice: 'rocnik_added'
---
SELECT  `rocniks`.* FROM `rocniks`  ORDER BY cislo DESC LIMIT 1
INSERT INTO `rocniks` (`cislo`, `created_at`, `updated_at`) VALUES (2, '2016-11-16 20:39:37.176139', '2016-11-16 20:39:37.176139')

  def create
    @rocnik = Rocnik.new(rocnik_params)

    respond_to do |format|
      if @rocnik.save
---
INSERT INTO `rocniks` (`cislo`, `created_at`, `updated_at`) VALUES (5, '2016-11-16 15:34:02.850946', '2016-11-16 15:34:02.850946')

  def destroy
    @rocnik.destroy
---
DELETE FROM `rocniks` WHERE `rocniks`.`id` = 2

  def set_rocnik
    @rocnik = Rocnik.find(params[:id])
---
SELECT  `rocniks`.* FROM `rocniks` WHERE `rocniks`.`id` = 2 LIMIT 1