app/views/rocniks/show.html.erb

SELECT `rocniks`.* FROM `rocniks`  ORDER BY `rocniks`.`cislo` ASC
---
      <option value="/rocniks/<%= @rocnik.id %>">Zmeniť ročník</option>
      <% Rocnik.order('cislo DESC').each do |r| %>